//------------------------------------
// ИТА ЮФУ (ИКТИБ)
// Инженерия ПО для СРВ и ИВ
// Лабораторная работа №1. Вариант 0 
// Память. Вычислительные блоки. Программный секвенсор
// Выполнил: Верещагин Данил Олегович
// КТбо2-9
// 20.03.2023
//------------------------------------
#include <def21060.h>

#define cnARRNUMBER 32
#define cnPACKNUMBER cnARRNUMBER / 32
#define c_astr 2

//------------------------------------
//сегмент данных в DM
//------------------------------------
.SECTION/DM		dm_data;
.VAR input[cnARRNUMBER] = "input.dat";
.VAR delta[cnARRNUMBER];
.VAR deltapack[cnPACKNUMBER];


//------------------------------------
//сегмент данных в PM
//------------------------------------
.SECTION/PM		pm_data;
.VAR output[cnARRNUMBER];


//------------------------------------
// Обработчик RESET
//------------------------------------
.SECTION/PM pm_irq_svc;
	nop;
	jump start;
	nop;
	nop;


//------------------------------------
// Сегмент кода
//------------------------------------
.SECTION/PM pm_code;
start:
	// Доступ к буферу входных значений y(i)
	B1 = input;  // DM: 0-7; PM: 8-15
	M7 = 1;
	L1 = @input;
	
	// Доступ к delta(i)
	B2 = delta;
	L2 = @delta;
	
	// Доступ к упакованным битам 
	I3 = deltapack;
	M3 = 0;
	R3 = 32;
	
	// Доступ к Y(i)
	B8 = output;
	M15 = 1;
	L8 = @output;

	
		// Начальные значения алгоритма
	R12 = 0; //Y(0)
	R13 = c_astr; // C - константа
	R14 = 0; // dY(0)
	R15 = -1; // множитель для изменения знака
	R5 = 0; // delta
	R4 = 0; // Z
	
	
	// Цикл прохода по элементам массива
	LCNTR = cnARRNUMBER, DO xxx until lce;	
		call compute_d(db);
			R2 = dm(I1, M7); // Прочитал y(i)
			R4 = R12 - R2; // z(i) = Y(i) - y(i)
		
		/* 1 порядка
		R14 = R13 * R0 (SSI); // dY(i)
		R12 = R12 + R14;
		*/
		
		
		R5 = R13*R0 (SSI); // delta

		
		call update_pack(db);
			R14 = R14 + R0; // dY(i)
			R12 = R12 + R14; //Y(i)
			
xxx:	dm(I2, M7) = R0, pm(I8, M15) = R12;	


wait: IDLE;
	  jump wait;


// ПП для вычисления delta
// ВХ. параметры: R4 (z(i))
// ВЫХ. параметры: R0 (+1/ -1), R1 (1/0 для упаковки))
compute_d:

	
		R0 = 1;
		R1 = 1;
		R4 = PASS R4; // Знак от z(i)
		rts(db);
			if GE R0 = R0 * R15 (SSI); // sign(z) +1/-1
			if MS R1 = R1 - 1;	 

// ПП для упаковки очередного бита в 32-разрядный pack
// ВХ. параметры: R1 - (0/1), I3,M3 - буфер, R9 - свободных битов в текущем слове
// Портит: R11
// Сдвигаем влево, пишем очередной R1 в младший разряд
// по мере заполнения - записываем в буфер
update_pack:
		R11 = dm(I3, M3);
		R11 = lshift R11 by 1;
		R11 = R11 or R1;
		
	// Счётчик свободных битов в слове уменьшить
		R9 = R9 - 1, dm(I3, M3) = R11;;
		if NE jump next_bit;
		R9 = 32;
		modify(I3, M7);
		
next_bit:	rts;
	  
	  
	  
	  
	  